aggosistemas@MacBook-Air-de-Antonio firestore-template % terraform apply -auto-approve
aggosistemas@MacBook-Air-de-Antonio firestore-template % terraform apply -auto-approve
google_project_service.firestore: Refreshing state... [id=vm-projeto-tf/firestore.googleapis.com]

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_firestore_database.default will be created
  + resource "google_firestore_database" "default" {
      + app_engine_integration_mode       = (known after apply)
      + concurrency_mode                  = (known after apply)
      + create_time                       = (known after apply)
      + database_edition                  = (known after apply)
      + delete_protection_state           = (known after apply)
      + deletion_policy                   = "ABANDON"
      + earliest_version_time             = (known after apply)
      + etag                              = (known after apply)
      + id                                = (known after apply)
      + key_prefix                        = (known after apply)
      + location_id                       = "us-central1"
      + name                              = "template-backstage"
      + point_in_time_recovery_enablement = "POINT_IN_TIME_RECOVERY_DISABLED"
      + project                           = "vm-projeto-tf"
      + type                              = "FIRESTORE_NATIVE"
      + uid                               = (known after apply)
      + update_time                       = (known after apply)
      + version_retention_period          = (known after apply)
    }

  # google_firestore_field.logs_pipeline_ttl will be created
  + resource "google_firestore_field" "logs_pipeline_ttl" {
      + collection = "logs_backstage"
      + database   = "template-backstage"
      + field      = "ttl_hot"
      + id         = (known after apply)
      + name       = (known after apply)
      + project    = "vm-projeto-tf"
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  ~ firestore_location    = "us-central-1" -> "us-central1"
google_firestore_database.default: Creating...
google_firestore_database.default: Still creating... [00m10s elapsed]
google_firestore_database.default: Creation complete after 13s [id=projects/vm-projeto-tf/databases/template-backstage]
google_firestore_field.logs_pipeline_ttl: Creating...
google_firestore_field.logs_pipeline_ttl: Creation complete after 4s [id=projects/vm-projeto-tf/databases/template-backstage/collectionGroups/logs_backstage/fields/ttl_hot]

Apply complete! Resources: 2 added, 0 changed, 0 destroyed.

Outputs:

firestore_collection = "logs_backstage"
firestore_database_id = "template-backstage"
firestore_location = "us-central1"
firestore_ttl_days = 7
firestore_ttl_field = "ttl_hot"
gcp_project_id = "vm-projeto-tf"